Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer.SecondChamferEndType Property
 The ChamferEndTypeEnum of the second end.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public EdgeChamfer.ChamferEndTypeEnum SecondChamferEndType { get; set; }
Public Property SecondChamferEndType As EdgeChamfer.ChamferEndTypeEnum
	Get
	Set
Property Value
Type: EdgeChamfer.ChamferEndTypeEnum
See Also
Reference
EdgeChamfer Class
Tekla.Structures.Model Namespace